## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.terraform-azure-collection.azurerm_service_plan.observe_service_plan_flex will be created
  + resource "azurerm_service_plan" "observe_service_plan_flex" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "centralus"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "observeServicePlanSecured-179969258044centralus-6c351029"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "gh-rg-nikhil-flex-plan-pvt-endpoint"
      + sku_name                     = "FC1"
      + worker_count                 = (known after apply)
    }

  # module.terraform-azure-collection.azurerm_storage_share.observe_storage_account_secured_share will be created
  + resource "azurerm_storage_share" "observe_storage_account_secured_share" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "gh-fa-nikhil-flex-plan-pvt-endpoint-aea2"
      + quota                = 102400
      + resource_manager_id  = (known after apply)
      + storage_account_name = "179969258044cu6c351029"
      + url                  = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>